<?php

$lang['sys_moon'] 				= "Луна";
$lang['sys_error'] 				= "Ошибка";
$lang['sys_no_vars'] 			= "Ошибка инициализации переменных, обратитесь к администрации!";
$lang['sys_attacker_lostunits'] 		= "Атакующий потерял %s единиц.";
$lang['sys_defender_lostunits'] 		= "Обороняющийся потерял %s единиц.";
$lang['sys_gcdrunits'] 			= "Теперь на этих пространственных координатах находятся %s %s и %s %s.";
$lang['sys_moonproba'] 			= "Шанс появления луны составляет: %d %% ";
$lang['sys_moonbuilt'] 			= "Благодаря огромной энергии огромные куски металла и кристалла соединяются и образуется новая планета %s [%d:%d:%d] !";
$lang['sys_attack_title']    			= "%s. Произошёл бой между следующими флотами::";
$lang['sys_attack_attacker_pos']	      	= "Атакующий %s [%s:%s:%s]";
$lang['sys_attack_techologies'] 		= "Вооружение: %d %% Щиты: %d %% Броня: %d %% ";
$lang['sys_attack_defender_pos'] 		= "Обороняющийся %s [%s:%s:%s]";
$lang['sys_ship_type'] 			= "Тип";
$lang['sys_ship_count'] 			= "Кол-во";
$lang['sys_ship_weapon'] 			= "Вооружение";
$lang['sys_ship_shield'] 			= "Щиты";
$lang['sys_ship_armour'] 			= "Броня";
$lang['sys_destroyed'] 			= "уничтожен";
$lang['sys_attack_attack_wave'] 		= "Атакующий флот делает: %s выстрела(ов) с общей мощностью %s по обороняющемуся. Щиты обороняющегося поглощают %s выстрелов.";
$lang['sys_attack_defend_wave']		= "Обороняющийся флот делает: %s выстрела(ов) с общей мощностью %s по атакующему. Щиты атакующего поглащают %s выстрелов.";
$lang['sys_attacker_won'] 			= "Атакующий выиграл битву!";
$lang['sys_defender_won'] 			= "Обороняющийся выиграл битву!";
$lang['sys_both_won'] 			= "Бой закончился ничьёй!";
$lang['sys_stealed_ressources'] 		= "Он получает %s металла %s %s кристалла %s и %s дейтерия.";
$lang['sys_rapport_build_time'] 		= "Время генерации страницы %s секунд";
$lang['sys_tran_mess_back'] 		= "Один из ваших флотов возвращается на планету %s %s.";
$lang['sys_recy_gotten'] 			= "Ваш переработчик собрал %s %s и %s %s из поля обломков.";
$lang['sys_notenough_money'] 		= "У вас недостаточно ресурсов чтобы начать строительство на %s. У вас есть %s %s , %s %s и %s %s. Затраты на строительство состовляют %s %s , %s %s и %s %s.";
$lang['sys_nomore_level'] 			= "Вы пытаетесь разрушить здание которого нету( %s ).";
$lang['sys_gain'] 				= "Добыча: ";
$lang['sys_perte_attaquant'] 			= "Атакующий потерял";
$lang['sys_perte_defenseur'] 		= "Обороняющийся потерял";
$lang['sys_debris'] 			= "Обломки: ";
$lang['sys_noaccess'] 			= "В доступе отказано";
$lang['sys_noalloaw'] 			= "У вас нет сюда доступа.";

$lang['Tech']         = "Технология";
$lang['Metal']        = "Металл";
$lang['Crystal']      = "Кристалл";
$lang['Deuterium']    = "Дейтерий";
$lang['Energy']       = "Энергия";
$lang['level']        = "уровень";



$lang['tech_rc'] = array (
200 => "Флот",
202 => "Малый транспорт",
203 => "Большой транспорт",
204 => "Лёгкий истребитель",
205 => "Тяжёлый истребитель",
206 => "Крейсер",
207 => "Линкор",
208 => "Колонизатор",
209 => "Переработчик",
210 => "Шпионский зонд",
211 => "Бомбардировщик",
212 => "Солнечный спутник",
213 => "Уничтожитель",
214 => "Звезда смерти",
215 => "Линейный крейсер",

401 => "Ракетная установка",
402 => "Легкий лазер",
403 => "Тяжёлый лазер",
404 => "Пушка Гаусса",
405 => "Ионовое орудие",
406 => "Плазменное орудие",
407 => "Малый щитовой купол",
408 => "Большой щитовой купол",
);

$lang['tech'] = array(
0 => "Постройки",
1 => "Рудник по добыче металла",
2 => "Рудник по добыче кристаллов",
3 => "Синтезатор дейтерия",
4 => "Солнечная электростанция",
12 => "Термоядерная электростанция",
14 => "Фабрика роботов",
15 => "Фабрика нанитов",
21 => "Верфь",
22 => "Хранилище металла",
23 => "Хранилище кристаллов",
24 => "Емкость для дейтерия",
31 => "Исследовательская лаборатория",
33 => "Терраформер",
34 => "Склад альянса",
40 => "Особые постройки",
41 => "Лунная база",
42 => "Сенсорная фаланга",
43 => "Межгалактические врата",
44 => "Ракетная шахта",

100 => "Исследования",
106 => "Шпионаж",
108 => "Компьютерная технология",
109 => "Оружейная технология",
110 => "Щитовая технология",
111 => "Броня космических кораблей",
113 => "Энергетическая технология",
114 => "Гиперпространственная технология",
115 => "Ракетный двигатель",
117 => "Импульсный двигатель",
118 => "Гиперпространственный двигатель",
120 => "Лазерная технология",
121 => "Ионная технология",
122 => "Плазменная технология",
123 => "Межгалактическая исследовательская сеть",
124 => 'Экспедиционная технология',
150 => 'Технология колонизации',
199 => "Гравитационная технология",

200 => "Флот",
202 => "Малый транспорт",
203 => "Большой транспорт",
204 => "Лёгкий истребитель",
205 => "Тяжёлый истребитель",
206 => "Крейсер",
207 => "Линкор",
208 => "Колонизатор",
209 => "Переработчик",
210 => "Шпионский зонд",
211 => "Бомбардировщик",
212 => "Солнечный спутник",
213 => "Уничтожитель",
214 => "Звезда смерти",
215 => "Линейный крейсер",

400 => "Оборона",
401 => "Ракетная установка",
402 => "Легкий лазер",
403 => "Тяжёлый лазер",
404 => "Пушка Гаусса",
405 => "Ионовое орудие",
406 => "Плазменное орудие",
407 => "Малый щитовой купол",
408 => "Большой щитовой купол",
502 => "Ракета-перехватчик",
503 => "Межпланетная ракета",

600 => "Офицеры",
601 => "Геолог",
602 => "Адмирал",
603 => "Инженер",
604 => "Технократ",
605 => "Конструктор",
606 => "Специалист",
607 => "Хранитель",
608 => "Защитник",
609 => "Бункер",
610 => "Шпион",
611 => "Командир",
612 => "Разрушитель",
613 => "Генерал",
614 => "Рейдер",
615 => "Император"

);

?>