<?php

if (!defined('INSIDE')) {
	die("attemp hacking");
}

$lang['cookies']['Error1'] = 'Ошибка COOKIE ! <a href=login.php>Login</a> Зайдите для получения новых COOKIES. Если не получается, то удалите все куки из вашего браузера. Если проблема не исправляется, то обратитесь к администрации.';
$lang['cookies']['Error2'] = 'Ошибка COOKIE ! <a href=login.php>Login</a> Зайдите для получения новых COOKIES. Если не получается, то удалите все куки из вашего браузера. Если проблема не исправляется, то обратитесь к администрации.';
$lang['cookies']['Error3'] = 'Ошибка COOKIE ! <a href=login.php>Login</a> Зайдите для получения новых COOKIES. Если не получается, то удалите все куки из вашего браузера. Если проблема не исправляется, то обратитесь к администрации.';

?>