<?php

if (!defined('INSIDE')) {
	die("attemp hacking");
}

$lang['NoPoints']     = "У вас недостаточно кредитов!";
$lang['OffiRecrute']  = "Офицер был завербован!";
$lang['off_points']   = "Доступно кредитов : ";

$lang['Officier']     = "Офицер";

$lang['ttle'][601] = "Геолог";
$lang['ttle'][602] = "Адмирал";
$lang['ttle'][603] = "Инженер";
$lang['ttle'][604] = "Технократ";
$lang['ttle'][605] = "Архитектор";
$lang['ttle'][606] = "Метафизик";
$lang['ttle'][607] = "Наёмник";

$lang['Desc'][601] = "<br><br> Геолог - это признанный эксперт в астроминералогии и кристаллографии. Он со своей командой металлургов и химиков он поддерживает межпланетные правительства при разработке новых источников ресурсов и оптимизации их очистки.<table><tr><td><img src=\"/images/officiers/601.gif\"></td><td><br><font color=\"#84CFEF\">+25% доход от шахт</font></td></tr><tr><td>&nbsp;</td><td><font color=\"#84CFEF\">+25% вместимость хранилищ</font><td></tr></table>";
$lang['Desc'][602] = "<br><br> Адмирал - это испытанный войной ветеран и гениальный стратег. Даже в самых горячих боях он не теряет обзора и поддерживает контакт с подчинёнными ему адмиралами. Мудрый правитель может полностью положиться на него в бою и тем самым использовать для боя больше кораблей.<table><tr><td><img src=\"/images/officiers/602.gif\"></td><td><br><font color=\"#84CFEF\">Макс. кол-во флотов +2</font></td></tr><tr><td>&nbsp;</td><td><font color=\"#84CFEF\">+25% к скорости кораблей</font></td></tr><tr><td>&nbsp;</td><td><font color=\"#84CFEF\">-10% затраты на строительство кораблей</font></td></tr></table>";
$lang['Desc'][603] = "<br><br> Инженер - это специалист по управлению энергией. В мирное время он повышает уровень энергетических сетей на колониях. В случае нападения он снабжает энергетические системы планетарных защит и предотвращает перегрузки, что ведёт к значительно меньшей степени потерь в бою.<table><tr><td><img src=\"/images/officiers/603.gif\"></td><td><br><font color=\"#84CFEF\">-50% потери при обороне</font></td></tr><tr><td>&nbsp;</td><td><font color=\"#84CFEF\">+15% выработка энергии</font><td></tr><tr><td>&nbsp;</td><td><font color=\"#84CFEF\">-10% затраты на строительство обороны</font><td></tr></table>";
$lang['Desc'][604] = "<br><br> Гильдия технократов - это гениальные учёные, и их всегда можно найти там, где заканчивается грань технически возможного. Их код никогда не сможет разгадать ни один нормальный человек, и одним своим присутствием они вдохновляют учёных империи.<table><tr><td><img src=\"/images/officiers/604.gif\"></td><td><br><font color=\"#84CFEF\">+2 к уровню шпионажа</font></td></tr><tr><td>&nbsp;</td><td><font color=\"#84CFEF\">-25% времени на исследования</font><td></tr></table>";
$lang['Desc'][605] = "<br><br> Архитектор - это незаменимый специалист в любом строительстве. Благодаря исследованиям и экспериментам, связанным с проектным решением, авторскому надзору за строительством и научному подходу, позволяет ускорить строительство и увеличить КПД строителей.<table><tr><td><img src=\"/images/officiers/605.gif\"></td><td><br><font color=\"#84CFEF\">+2 к очереди построек</font></td></tr><tr><td>&nbsp;</td><td><font color=\"#84CFEF\">-25% времени на постройку</font><td></tr></table>";
$lang['Desc'][606] = "<br><br> Метафизик - это высококласный специалист в лунном деле. Благодаря своим знаниям он может усиливать гравитационную пушку Звезды Смерти, что позволяет эффективнее применять её в уничтожении лун.<table><tr><td><img src=\"/images/officiers/606.gif\"></td><td><br><font color=\"#84CFEF\">+25% мощности ЗС в уничтожении луны</font></td></tr><tr><td>&nbsp;</td><td><font color=\"#84CFEF\">-25% шанса уничтожения ЗС</font><td></tr></table>";
$lang['Desc'][607] = "<br><br> Наёмник - высококласный специалист в военном деле. Нанятый к вам на службу, он помогает увеличить эффективность вашего вооружения.<table><tr><td><img src=\"/images/officiers/607.gif\"></td><td><br><font color=\"#84CFEF\">+10% Вооружение</font></td></tr><tr><td>&nbsp;</td><td><font color=\"#84CFEF\">+10% Щиты</font><td></tr><tr><td>&nbsp;</td><td><font color=\"#84CFEF\">+10% Броня</font><td></tr></table>";

?>